Revit 2027 API
ParameterTypeId.NodeConnectionStatus Property
 "Connection Status"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId NodeConnectionStatus { get; }
Public Shared ReadOnly Property NodeConnectionStatus As ForgeTypeId
	Get
public:
static property ForgeTypeId^ NodeConnectionStatus {
	ForgeTypeId^ get ();
}
static member NodeConnectionStatus : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace